<template>
  <!-- 註冊Modal -->
  <div class="modal fade" ref="modal" id="modal"  tabindex="-1" aria-labelledby="registerModalLabel"
       aria-hidden="true">
    <div class="modal-dialog">
      <div class="modal-content">
        <div class="position-relative">
          <button type="button" class="m-3 btn  fs-4 position-absolute top-0 end-0"
                  data-bs-dismiss="modal" aria-label="Close">
            <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M14 1.41L12.59 0L7 5.59L1.41 0L0 1.41L5.59 7L0 12.59L1.41 14L7 8.41L12.59 14L14 12.59L8.41 7L14 1.41Z"
                fill="black"/>
            </svg>
          </button>
          <h2 class="modal-title text-center mt-3 mt-md-7 mb-2 text-secondary" id="loginModalLabel">會員註冊</h2>
          <div class="line bg-primary mb-3 mb-md-5"></div>
        </div>
        <div class="modal-body">
          <!-- active 功能切換 tabs 顏色手寫 -->
          <ul class="nav row g-0" id="myTab" role="tablist">
            <li class="nav-item col col-md-5 d-grid gap-2 offset-md-1" role="presentation">
              <button class="nav-link border-0 rounded-top  border-top border-start border-end bg-primary-shallow border-primary text-dark"  id="member-tab" @click="isLawyer = false"
                      data-bs-toggle="tab" data-bs-target="#member" type="button" role="tab"
                      aria-controls="member" aria-selected="true">一般會員
              </button>
            </li>
            <li class="nav-item col col-md-5 d-grid gap-2" role="presentation">
              <button class="nav-link border-0 rounded-top border-top border-start border-end border-primary  text-dark" id="lawyer-tab" @click="isLawyer = true"
                      data-bs-toggle="tab" data-bs-target="#lawyer" type="button" role="tab"
                      aria-controls="lawyer" aria-selected="false">律師會員
              </button>
            </li>
          </ul>
          <div class="tab-content" id="myTabContent">
            <div class="tab-pane fade show active row g-0" id="member" role="tabpanel"
                 aria-labelledby="member-tab">
              <!-- 下方 modal 內容外層 -->
              <div
                class="col col-md-10 bg-primary-shallow border-primary border border-1 border-top-0 rounded-bottom offset-md-1 py-3 px-4">
                <v-form class="row " v-slot="{ errors }" @submit="onSubmit(value)">
                  <!-- google 按鈕 -->
                  <div class="my-3">
                    <a href="#" class="btn d-block btn-outline-secondary">
                      <svg width="74" height="24" viewBox="0 0 74 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_407:5258)">
                          <path
                            d="M0.612793 8.63336C0.873595 8.29435 0.805802 7.87438 0.877583 7.4931C2.13773 0.803449 10.4742 -2.30586 15.788 1.93933C16.5185 2.52282 16.5197 2.52402 15.8805 3.16096C15.5148 3.52549 15.197 4.07748 14.7627 4.19553C14.3041 4.31957 13.946 3.6946 13.5153 3.43735C9.48844 1.02999 4.18785 3.5913 3.55978 8.26045C2.84277 13.5941 7.88414 17.5461 12.8266 15.5149C14.6478 14.7666 15.7393 13.4078 16.1022 11.4643C16.1752 11.0746 16.1142 10.9063 15.6516 10.9139C13.9675 10.9418 12.2827 10.9103 10.5986 10.9346C10.16 10.941 9.99768 10.8202 10.0399 10.3747C10.0966 9.77642 9.79749 8.99551 10.154 8.6206C10.5153 8.24091 11.3005 8.50813 11.8991 8.50374C13.9647 8.48899 16.0312 8.51371 18.0969 8.48619C18.5559 8.47981 18.727 8.62259 18.7672 9.0641C19.2745 14.6649 15.5694 18.0084 11.3743 18.5065C6.00988 19.1438 1.15274 15.1878 0.743194 10.0572C0.736016 9.96268 0.708101 9.88491 0.612793 9.84662"
                            fill="#2C84FA"/>
                          <path
                            d="M48.4005 12.3176C48.4049 13.6712 48.7331 14.5718 49.4848 15.2985C51.0073 16.7694 53.3729 16.4248 54.4089 14.5818C55.3137 12.9721 54.9771 10.7885 53.6217 9.67013C52.6471 8.86608 51.5361 8.75561 50.4095 9.2701C48.9883 9.9198 48.4324 11.1355 48.4005 12.3176ZM50.7461 23.9999C50.6137 23.7586 50.3497 23.8216 50.1511 23.7717C48.5337 23.3661 47.3573 22.4069 46.5115 20.9907C46.2662 20.5799 46.2104 20.2983 46.773 20.1774C46.8377 20.1635 46.8963 20.1236 46.9585 20.0981C47.4147 19.9122 47.8645 19.6003 48.3299 19.5752C48.8611 19.5469 48.8882 20.2317 49.2112 20.5499C50.2329 21.5562 51.4172 21.8166 52.7392 21.3787C54.0261 20.9524 54.5664 19.9325 54.6685 18.6471C54.7028 18.2132 54.6741 17.7744 54.6741 17.3022C52.3113 18.9506 50.1726 18.9745 48.1433 17.4139C46.0377 15.7946 45.2138 13.0674 46.0871 10.6066C46.9629 8.13901 49.2483 6.52413 51.7347 6.61546C52.6622 6.64976 53.1946 6.86832 54.5939 7.79003C54.623 7.76291 54.68 7.7314 54.6769 7.70907C54.5672 6.97122 54.9337 6.84679 55.5933 6.86593C57.2143 6.91379 57.2155 6.88148 57.2155 8.51631C57.2155 11.5702 57.2123 14.6241 57.2175 17.6779C57.2183 18.3998 57.1457 19.1089 56.9734 19.8109C56.41 22.1078 54.9528 23.4383 52.6375 23.8539C52.4955 23.8794 52.3113 23.8028 52.2288 23.9999"
                            fill="#2C84FA"/>
                          <path
                            d="M68.207 8.91435C66.4771 8.9307 64.9972 10.4243 64.9645 12.0292C64.9557 12.4608 65.1575 12.3308 65.3653 12.2446C66.8926 11.6117 68.4155 10.9683 69.9469 10.3454C70.2647 10.2161 70.307 10.0853 70.0964 9.82169C69.578 9.17399 68.8741 8.95463 68.207 8.91435ZM73.3867 11.1953C73.1666 11.1111 72.9983 11.2591 72.8193 11.3329C70.5199 12.2785 68.2265 13.2393 65.9216 14.1722C65.4749 14.3533 65.3972 14.5032 65.6975 14.918C66.9173 16.6019 69.393 16.6896 70.8365 15.0325C71.1783 14.64 71.4052 14.5842 71.7836 14.9148C72.0014 15.1051 72.2666 15.2403 72.5094 15.4018C73.3409 15.9558 73.3409 15.9562 72.6697 16.6737C70.9283 18.5358 68.2369 19.0902 65.8693 18.0748C63.5851 17.0948 62.1918 14.7469 62.3593 12.1589C62.5268 9.56804 64.076 7.53039 66.4041 6.83921C69.1158 6.03396 71.7306 7.30744 72.9624 10.0299C73.0984 10.331 73.1586 10.6684 73.3867 10.9261"
                            fill="#FC2E28"/>
                          <path
                            d="M22.4456 12.5517C22.4368 14.6097 23.8744 16.1847 25.7754 16.1995C27.6891 16.2146 29.171 14.6604 29.183 12.6255C29.1945 10.5703 27.7601 9.0001 25.8492 8.97617C23.9386 8.95263 22.4544 10.5121 22.4456 12.5517ZM25.8081 6.61227C29.2117 6.61188 31.8361 9.23581 31.8141 12.6171C31.7926 15.9713 29.1714 18.5785 25.8181 18.5813C22.442 18.5837 19.7829 15.9175 19.8132 12.5593C19.8436 9.18276 22.4348 6.61227 25.8081 6.61227Z"
                            fill="#FC2E28"/>
                          <path
                            d="M35.3833 12.5872C35.3837 14.6384 36.8368 16.1975 38.7486 16.1987C40.6575 16.1999 42.1198 14.6348 42.1206 12.59C42.1214 10.538 40.6687 8.98175 38.7518 8.98175C36.832 8.98135 35.3825 10.5328 35.3833 12.5872ZM38.7386 6.61228C42.1466 6.60869 44.7825 9.24299 44.7562 12.6263C44.7307 15.9789 42.0824 18.5961 38.7302 18.5829C35.3761 18.5693 32.735 15.9223 32.7461 12.5844C32.7573 9.21308 35.3637 6.61587 38.7386 6.61228Z"
                            fill="#FDBA03"/>
                          <path
                            d="M58.8323 9.44439C58.8323 6.70719 58.8419 3.96999 58.8228 1.23279C58.82 0.80325 58.9181 0.636936 59.3715 0.673628C59.9708 0.721887 60.7556 0.482188 61.1285 0.780915C61.5217 1.09639 61.2505 1.91321 61.2517 2.50866C61.2625 7.53478 61.2505 12.5605 61.2697 17.5862C61.2717 18.0784 61.1704 18.2662 60.6512 18.2144C60.0761 18.1569 59.2985 18.4014 58.9631 18.1091C58.5727 17.7677 58.8427 16.9736 58.8387 16.3777C58.8232 14.0665 58.8323 11.7556 58.8323 9.44439Z"
                            fill="#00AB46"/>
                          <path
                            d="M48.4004 12.3176C48.4323 11.1355 48.9882 9.91981 50.4094 9.27011C51.536 8.75561 52.647 8.86609 53.6216 9.67014C54.9771 10.7885 55.3136 12.9721 54.4088 14.5818C53.3728 16.4248 51.0072 16.7694 49.4847 15.2985C48.733 14.5718 48.4048 13.6712 48.4004 12.3176Z"
                            fill="#FDFCFD"/>
                          <path
                            d="M68.2076 8.91434C68.8748 8.95463 69.5786 9.17399 70.097 9.82169C70.3076 10.0853 70.2653 10.2161 69.9475 10.3454C68.4162 10.9683 66.8932 11.6117 65.3659 12.2446C65.1581 12.3308 64.9563 12.4608 64.9651 12.0292C64.9978 10.4243 66.4777 8.9307 68.2076 8.91434Z"
                            fill="#FDFBFB"/>
                          <path
                            d="M22.4454 12.5517C22.4541 10.5121 23.9384 8.95263 25.8489 8.97617C27.7599 9.0001 29.1943 10.5703 29.1827 12.6255C29.1708 14.6604 27.6889 16.2146 25.7752 16.1995C23.8742 16.1847 22.4366 14.6097 22.4454 12.5517Z"
                            fill="#FDFBFB"/>
                          <path
                            d="M35.3833 12.5872C35.3825 10.5328 36.8321 8.98135 38.7518 8.98175C40.6687 8.98175 42.1215 10.538 42.1207 12.59C42.1199 14.6348 40.6576 16.1999 38.7486 16.1987C36.8369 16.1975 35.3837 14.6384 35.3833 12.5872Z"
                            fill="#FDFBFB"/>
                        </g>
                        <defs>
                          <clipPath id="clip0_407:5258">
                            <rect width="72.7742" height="24" fill="white" transform="translate(0.612793)"/>
                          </clipPath>
                        </defs>
                      </svg>
                    </a>
                  </div>
                  <!-- 分隔線 -->
                  <div class="text-center">
                    <p class="divider mb-3">或</p>
                  </div>
                  <!-- 信箱 -->
                  <div class="mb-3">
                    <v-field name="email" type="email" :class="{ 'is-invalid': errors['email'] }" placeholder="請輸入 Email" rules="email|required" class="form-control"
                          v-model="user.mail"   id="registerEmail"></v-field>
                    <!-- 信箱錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="email" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;{{ errors.email }}</p>
                      </error-message>
                    </div>
                  </div>
                  <!-- 密碼 -->
                  <div class="mb-3">
                    <v-field type="password" name="密碼"  :class="{ 'is-invalid': errors['密碼'] }" rules="required|min:8" placeholder="至少 8 位數密碼，請區分大小寫" class="form-control"
                         v-model="user.password" id="registerPassword"></v-field>
                    <!-- 密碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="密碼" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;{{ errors.密碼 }}</p>
                      </error-message>
                    </div>
                  </div>

                  <!-- 確認密碼 -->
                  <div class="mb-3">
                    <v-field type="password" name="確認密碼" :rules="checkPassword"  :class="{ 'is-invalid': errors['確認密碼'] }"  placeholder="再次輸入您的密碼" class="form-control"
                           id="registerCheckPassword"></v-field>
                    <!-- 密碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="確認密碼" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;密碼輸入不一致</p>
                      </error-message>
                    </div>
                  </div>

                  <!-- 按鈕 -->
                  <button  class="btn btn-secondary text-white">註冊
                  </button>
                </v-form>
              </div>
            </div>
            <div class="tab-pane fade" id="lawyer" role="tabpanel" aria-labelledby="lawyer-tab">
              <div
                class="col col-md-10 bg-primary-shallow border-primary border border-1 border-top-0 rounded-bottom offset-md-1 py-3 px-4">
                <v-form class="row" v-slot="{ errors }" @submit="onSubmit">
                  <!-- google 按鈕 -->
                  <div class="my-3">
                    <a href="#" class="btn d-block btn-outline-secondary">
                      <svg width="74" height="24" viewBox="0 0 74 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_407:5258)">
                          <path
                            d="M0.612793 8.63336C0.873595 8.29435 0.805802 7.87438 0.877583 7.4931C2.13773 0.803449 10.4742 -2.30586 15.788 1.93933C16.5185 2.52282 16.5197 2.52402 15.8805 3.16096C15.5148 3.52549 15.197 4.07748 14.7627 4.19553C14.3041 4.31957 13.946 3.6946 13.5153 3.43735C9.48844 1.02999 4.18785 3.5913 3.55978 8.26045C2.84277 13.5941 7.88414 17.5461 12.8266 15.5149C14.6478 14.7666 15.7393 13.4078 16.1022 11.4643C16.1752 11.0746 16.1142 10.9063 15.6516 10.9139C13.9675 10.9418 12.2827 10.9103 10.5986 10.9346C10.16 10.941 9.99768 10.8202 10.0399 10.3747C10.0966 9.77642 9.79749 8.99551 10.154 8.6206C10.5153 8.24091 11.3005 8.50813 11.8991 8.50374C13.9647 8.48899 16.0312 8.51371 18.0969 8.48619C18.5559 8.47981 18.727 8.62259 18.7672 9.0641C19.2745 14.6649 15.5694 18.0084 11.3743 18.5065C6.00988 19.1438 1.15274 15.1878 0.743194 10.0572C0.736016 9.96268 0.708101 9.88491 0.612793 9.84662"
                            fill="#2C84FA"/>
                          <path
                            d="M48.4005 12.3176C48.4049 13.6712 48.7331 14.5718 49.4848 15.2985C51.0073 16.7694 53.3729 16.4248 54.4089 14.5818C55.3137 12.9721 54.9771 10.7885 53.6217 9.67013C52.6471 8.86608 51.5361 8.75561 50.4095 9.2701C48.9883 9.9198 48.4324 11.1355 48.4005 12.3176ZM50.7461 23.9999C50.6137 23.7586 50.3497 23.8216 50.1511 23.7717C48.5337 23.3661 47.3573 22.4069 46.5115 20.9907C46.2662 20.5799 46.2104 20.2983 46.773 20.1774C46.8377 20.1635 46.8963 20.1236 46.9585 20.0981C47.4147 19.9122 47.8645 19.6003 48.3299 19.5752C48.8611 19.5469 48.8882 20.2317 49.2112 20.5499C50.2329 21.5562 51.4172 21.8166 52.7392 21.3787C54.0261 20.9524 54.5664 19.9325 54.6685 18.6471C54.7028 18.2132 54.6741 17.7744 54.6741 17.3022C52.3113 18.9506 50.1726 18.9745 48.1433 17.4139C46.0377 15.7946 45.2138 13.0674 46.0871 10.6066C46.9629 8.13901 49.2483 6.52413 51.7347 6.61546C52.6622 6.64976 53.1946 6.86832 54.5939 7.79003C54.623 7.76291 54.68 7.7314 54.6769 7.70907C54.5672 6.97122 54.9337 6.84679 55.5933 6.86593C57.2143 6.91379 57.2155 6.88148 57.2155 8.51631C57.2155 11.5702 57.2123 14.6241 57.2175 17.6779C57.2183 18.3998 57.1457 19.1089 56.9734 19.8109C56.41 22.1078 54.9528 23.4383 52.6375 23.8539C52.4955 23.8794 52.3113 23.8028 52.2288 23.9999"
                            fill="#2C84FA"/>
                          <path
                            d="M68.207 8.91435C66.4771 8.9307 64.9972 10.4243 64.9645 12.0292C64.9557 12.4608 65.1575 12.3308 65.3653 12.2446C66.8926 11.6117 68.4155 10.9683 69.9469 10.3454C70.2647 10.2161 70.307 10.0853 70.0964 9.82169C69.578 9.17399 68.8741 8.95463 68.207 8.91435ZM73.3867 11.1953C73.1666 11.1111 72.9983 11.2591 72.8193 11.3329C70.5199 12.2785 68.2265 13.2393 65.9216 14.1722C65.4749 14.3533 65.3972 14.5032 65.6975 14.918C66.9173 16.6019 69.393 16.6896 70.8365 15.0325C71.1783 14.64 71.4052 14.5842 71.7836 14.9148C72.0014 15.1051 72.2666 15.2403 72.5094 15.4018C73.3409 15.9558 73.3409 15.9562 72.6697 16.6737C70.9283 18.5358 68.2369 19.0902 65.8693 18.0748C63.5851 17.0948 62.1918 14.7469 62.3593 12.1589C62.5268 9.56804 64.076 7.53039 66.4041 6.83921C69.1158 6.03396 71.7306 7.30744 72.9624 10.0299C73.0984 10.331 73.1586 10.6684 73.3867 10.9261"
                            fill="#FC2E28"/>
                          <path
                            d="M22.4456 12.5517C22.4368 14.6097 23.8744 16.1847 25.7754 16.1995C27.6891 16.2146 29.171 14.6604 29.183 12.6255C29.1945 10.5703 27.7601 9.0001 25.8492 8.97617C23.9386 8.95263 22.4544 10.5121 22.4456 12.5517ZM25.8081 6.61227C29.2117 6.61188 31.8361 9.23581 31.8141 12.6171C31.7926 15.9713 29.1714 18.5785 25.8181 18.5813C22.442 18.5837 19.7829 15.9175 19.8132 12.5593C19.8436 9.18276 22.4348 6.61227 25.8081 6.61227Z"
                            fill="#FC2E28"/>
                          <path
                            d="M35.3833 12.5872C35.3837 14.6384 36.8368 16.1975 38.7486 16.1987C40.6575 16.1999 42.1198 14.6348 42.1206 12.59C42.1214 10.538 40.6687 8.98175 38.7518 8.98175C36.832 8.98135 35.3825 10.5328 35.3833 12.5872ZM38.7386 6.61228C42.1466 6.60869 44.7825 9.24299 44.7562 12.6263C44.7307 15.9789 42.0824 18.5961 38.7302 18.5829C35.3761 18.5693 32.735 15.9223 32.7461 12.5844C32.7573 9.21308 35.3637 6.61587 38.7386 6.61228Z"
                            fill="#FDBA03"/>
                          <path
                            d="M58.8323 9.44439C58.8323 6.70719 58.8419 3.96999 58.8228 1.23279C58.82 0.80325 58.9181 0.636936 59.3715 0.673628C59.9708 0.721887 60.7556 0.482188 61.1285 0.780915C61.5217 1.09639 61.2505 1.91321 61.2517 2.50866C61.2625 7.53478 61.2505 12.5605 61.2697 17.5862C61.2717 18.0784 61.1704 18.2662 60.6512 18.2144C60.0761 18.1569 59.2985 18.4014 58.9631 18.1091C58.5727 17.7677 58.8427 16.9736 58.8387 16.3777C58.8232 14.0665 58.8323 11.7556 58.8323 9.44439Z"
                            fill="#00AB46"/>
                          <path
                            d="M48.4004 12.3176C48.4323 11.1355 48.9882 9.91981 50.4094 9.27011C51.536 8.75561 52.647 8.86609 53.6216 9.67014C54.9771 10.7885 55.3136 12.9721 54.4088 14.5818C53.3728 16.4248 51.0072 16.7694 49.4847 15.2985C48.733 14.5718 48.4048 13.6712 48.4004 12.3176Z"
                            fill="#FDFCFD"/>
                          <path
                            d="M68.2076 8.91434C68.8748 8.95463 69.5786 9.17399 70.097 9.82169C70.3076 10.0853 70.2653 10.2161 69.9475 10.3454C68.4162 10.9683 66.8932 11.6117 65.3659 12.2446C65.1581 12.3308 64.9563 12.4608 64.9651 12.0292C64.9978 10.4243 66.4777 8.9307 68.2076 8.91434Z"
                            fill="#FDFBFB"/>
                          <path
                            d="M22.4454 12.5517C22.4541 10.5121 23.9384 8.95263 25.8489 8.97617C27.7599 9.0001 29.1943 10.5703 29.1827 12.6255C29.1708 14.6604 27.6889 16.2146 25.7752 16.1995C23.8742 16.1847 22.4366 14.6097 22.4454 12.5517Z"
                            fill="#FDFBFB"/>
                          <path
                            d="M35.3833 12.5872C35.3825 10.5328 36.8321 8.98135 38.7518 8.98175C40.6687 8.98175 42.1215 10.538 42.1207 12.59C42.1199 14.6348 40.6576 16.1999 38.7486 16.1987C36.8369 16.1975 35.3837 14.6384 35.3833 12.5872Z"
                            fill="#FDFBFB"/>
                        </g>
                        <defs>
                          <clipPath id="clip0_407:5258">
                            <rect width="72.7742" height="24" fill="white" transform="translate(0.612793)"/>
                          </clipPath>
                        </defs>
                      </svg>
                    </a>
                  </div>
                  <!-- 分隔線 -->
                  <div class="text-center">
                    <p class="divider mb-3">或</p>
                  </div>
                  <!-- 信箱 -->
                  <div class="mb-3">
                    <v-field name="email" type="email"  :class="{ 'is-invalid': errors['email'] }" placeholder="請輸入 Email" rules="email|required" class="form-control"
                             v-model="user.mail"  id="lawyerRegisterEmail"></v-field>
                    <!-- 信箱錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="email" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;{{ errors.email }}</p>
                      </error-message>
                    </div>
                  </div>
                  <!-- 密碼 -->
                  <div class="mb-3">
                    <v-field type="password" name="密碼"  :class="{ 'is-invalid': errors['密碼'] }" rules="required|min:8" placeholder="至少 8 位數密碼，請區分大小寫" class="form-control"
                             v-model="user.password" id="lawyerRegisterPassword"></v-field>
                    <!-- 密碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="密碼" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;{{ errors.密碼 }}</p>
                      </error-message>
                    </div>
                  </div>

                  <!-- 確認密碼 -->
                  <div class="mb-3">
                    <v-field type="password" name="確認密碼" :rules="checkPassword"  :class="{ 'is-invalid': errors['確認密碼'] }"  placeholder="再次輸入您的密碼" class="form-control"
                             id="lawyerCheckPassword"></v-field>
                    <!-- 密碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="確認密碼" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;密碼輸入不一致</p>
                      </error-message>
                    </div>
                  </div>

                  <!-- 手機號碼驗證 -->
                  <div class="mb-3">
                    <div class="row d-flex align-items-center">
                      <div class="col-8">
                        <v-field v-model="user.phone"  name="電話" type="text" class="form-control" :class="{ 'is-invalid': errors['電話'] }" id="lawyerPhone"  placeholder="請輸入電話" :rules="isPhone"></v-field>

                      </div>
                      <div class="col-4">
                        <button type="button"
                                class="btn btn-dark">送出驗證
                        </button>
                      </div>
                    </div>
                    <!-- 手機號碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <error-message name="電話" class="invalid-feedback">
                        <p class="text-danger m-0 ms-1">
                          <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                               xmlns="http://www.w3.org/2000/svg">
                            <path
                              d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                              fill="#DB3328"/>
                          </svg>&nbsp;電話號碼格式不正確 </p>
                      </error-message>
                    </div>
                  </div>
                  <!-- 驗證碼輸入 -->
                  <div class="mb-3">
                    <label for="lawyerVerificationCode" class="form-label d-none"></label>
                    <input v-model="user.veriCode" type="number" placeholder="輸入您的驗證碼" class="form-control"
                           id="lawyerVerificationCode">
                    <!-- 驗證碼錯誤提示 -->
                    <div class="d-flex align-items-center mt-1">
                      <svg width="14" height="14" viewBox="0 0 14 14" fill="none"
                           xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M6.99992 0.333374C3.31325 0.333374 0.333252 3.31337 0.333252 7.00004C0.333252 10.6867 3.31325 13.6667 6.99992 13.6667C10.6866 13.6667 13.6666 10.6867 13.6666 7.00004C13.6666 3.31337 10.6866 0.333374 6.99992 0.333374ZM10.3333 9.39337L9.39325 10.3334L6.99992 7.94004L4.60659 10.3334L3.66659 9.39337L6.05992 7.00004L3.66659 4.60671L4.60659 3.66671L6.99992 6.06004L9.39325 3.66671L10.3333 4.60671L7.93992 7.00004L10.3333 9.39337Z"
                          fill="#DB3328"/>
                      </svg>
                      <p class="text-danger m-0 ms-1">請輸入您的驗證碼</p>
                    </div>
                  </div>
                  <!-- 按鈕 -->
                  <button  class="btn  btn-secondary text-white">註冊</button>
                </v-form>
              </div>
            </div>
          </div>
        </div>

      </div>
    </div>
  </div>
  <!-- 歡迎 Modal -->
  <div class="modal fade" id="welcomeModal" tabindex="-1" aria-labelledby="welcomeModalLabel" aria-hidden="true">
    <div class="modal-dialog">
      <div class="modal-content">
        <div class="position-relative">
          <button type="button" class="m-3 btn  fs-4 position-absolute top-0 end-0"
                  data-bs-dismiss="modal" aria-label="Close">
            <svg width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M14 1.41L12.59 0L7 5.59L1.41 0L0 1.41L5.59 7L0 12.59L1.41 14L7 8.41L12.59 14L14 12.59L8.41 7L14 1.41Z"
                fill="black"/>
            </svg>
          </button>
          <h2 class="modal-title text-center mt-3 mt-md-7 mb-2" id="welcomeModalLabel">建立個人資料</h2>
          <div class="line bg-dark mb-3"></div>
        </div>
        <div class="modal-body">
          <div class="row ">
            <div class="col-md-8 offset-md-2 text-center">
          <img class="mb-3 mb-md-5" src="../../assets/img/logo.png" alt="logo">
              <h3 class="fs-4">歡迎使用法學電波</h3>
              <p>了解自身法律權益與周遭可使用的法律資源</p>
              <div class="d-grid gap-2 mb-md-7 mb-5">
                <button type="button" class="btn btn-dark">繼續</button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>
<script>
import modalMixin from '@/mixins/modalMixin'

export default {
  data () {
    return {
      modal: {},
      user: {
        isLawyer: false,
        isCommunity: false,
        mail: '',
        password: '',
        uid: '',
        phone: '',
        veriCode: ''
      }

    }
  },
  methods: {
    checkPassword (value) {
      if (this.user.password === value) {
        return true
      }
    },
    isPhone (value) {
      const phoneNumber = /^(09)[0-9]{8}$/
      return phoneNumber.test(value)
    },
    onSubmit () {
      // console.log(this.user.isLawyer, this.user.isCommunity, this.user.email, this.user.password, this.user.uid, this.user.phone, this.user.veriCode)
      console.log(this.user)
      const api = `${process.env.VUE_APP_API}`
      this.axios.post(`${api}api/signUp`, this.user)
        .then((res) => {
          console.log(res)
          if (res.data.success) {
            console.log(res.data.success)
          }
        })
        .catch((error) => { console.error(error) })
    }
  },
  mixins: [modalMixin]
}
</script>
